package com.korol.myweather.ui.details

object WeatherInterpretationCodes {
    val codesMap=mapOf(
     0 to "Чистое небо",
     1 to "В основном ясно",
     2 to "Частично облачно",
     3 to "Пасмурно",
     45 to "Туман",
     48 to "Изморозь, туман",
     51 to "Лёгкая морось",
     53 to "Морось",
     55 to "Сильная морось",

     56 to "Легкая ледяная морось",
     57 to "Сильная ледяная морось",

     61 to "Слабый дождь",
     63 to "Дождь",
     65 to "Ливень",

     66 to "Легкий ледяной дождь",
     67 to "Сильный ледяной дождь",
     71 to "Лёгкий снег",
     73 to "Снег",
     75 to "Сильный снег",

     77 to "Град",

     80 to "Слабый ливневый дождь",
     81 to "Ливневый дождь",
     82 to "Сильный ливневый дождь",
     85 to "Слабый снегопад",
     86 to "Сильный снегопад",

     95 to "Гроза",

     96 to "Гроза с небольшим градом",
     99 to "Гроза с сильным градом"
    )

 fun weatherCodeToWeather(code:Int):String {
  return codesMap.getOrElse(code) {"unknow weather"}
 }

}